#ifndef __MODBUS_CONF_H
#define __MODBUS_CONF_H
#ifdef __cplusplus
 extern "C" {
#endif


#include "Picocap_app.h"
#include "adc_app.h"

#define DA_MAX_VOL      4.5f
#define DA_HIH_VOL      3.7f
#define DA_LOW_VOL      2.3f
#define DA_MIN_VOL      0.5f

#define DAC_VALUE_MAX   4096

/* ModBus管理设备的参数结构,可根据不同的产品加入或删除成员 */
typedef struct {
    DataFilterParam *DataFilter;
    PCap_DataConvert_Param *PCap_DataConvert;
    PCap_DataConvert_Out_Param *PCap_DataConvert_Out; 
    ADC_TemperParam_TypeDef *ADC_TemperParam;
    ADC_TemperOut_TypeDef   *ADC_TemperOut;
}ModBus_Device_Param;


//****************************************************************************************************************************************************************
// 名称               :MB_Cap_Calibration()
// 创建日期           :2017-05-15
// 作者               :庄明群
// 功能               :电容标定功能
// 输入参数           :无
// 输出参数           :无
// 返回结果           :无
// 注意和说明         :
// 修改内容           :
//****************************************************************************************************************************************************************

void MB_Cap_Calibration(void *arg);

//****************************************************************************************************************************************************************
// 名称               :MB_CapAD_Calibration()
// 创建日期           :2017-05-15
// 作者               :庄明群
// 功能               :电容AD值标定功能
// 输入参数           :无
// 输出参数           :无
// 返回结果           :无
// 注意和说明         :标定值不能超过65535
// 修改内容           :
//****************************************************************************************************************************************************************

void MB_CapAD_Calibration(void *arg);

//****************************************************************************************************************************************************************
// 名称               :MB_CapDAOut_Calibration()
// 创建日期           :2017-05-15
// 作者               :庄明群
// 功能               :电容DA值标定功能
// 输入参数           :无
// 输出参数           :无
// 返回结果           :无
// 注意和说明         :标定值不能超过4095
// 修改内容           :
//****************************************************************************************************************************************************************

void MB_CapDAOut_Calibration(void *arg);

//****************************************************************************************************************************************************************
// 名称               :MB_TempDAOut_Calibration()
// 创建日期           :2017-05-15
// 作者               :庄明群
// 功能               :温度DA值标定功能
// 输入参数           :无
// 输出参数           :无
// 返回结果           :无
// 注意和说明         :标定值不能超过4095
// 修改内容           :
//****************************************************************************************************************************************************************

void MB_TempDAOut_Calibration(void *arg);

#ifdef __cplusplus
}
#endif
#endif
