/****************************************************************************************************************************************************************
** 版权:          2020-2030,深圳市信为科技发展有限公司
** 文件名:        iwdg_bsp.c
** 作者:          杨春林
** 版本:          V1.0.0
** 日期:          2020-04-27
** 描述:          独立看门狗初始化及应用
** 功能:          初始化独立看门狗,在系统出现异常时复位
*****************************************************************************************************************************************************************
** 修改者:        No
** 版本:          No
** 修改内容:      No
** 日期:          No
****************************************************************************************************************************************************************/

#include "iwdg_bsp.h"


static IWDG_HandleTypeDef hiwdg;

/**
* 名称       : BSP_IWDG_Init()
* 创建日期   : 2020-04-27
* 作者       : 杨春林
* 功能       : 独立看门狗初始化
* 输入参数   : 无
* 输出参数   : 无
* 返回结果   : 无
* 注意和说明 : 看门狗时钟由内部40KHz振荡器分频后得到，溢出时间 = 分频系数*重载值/40 ms，
*              例如8分频，重载值4000，则溢出时间为 800 ms
* 修改内容   :
*/
void BSP_IWDG_Init(void)
{

  hiwdg.Instance = IWDG;
  hiwdg.Init.Prescaler = IWDG_PRESCALER_32;
  hiwdg.Init.Window = IWDG_WINDOW_DISABLE;
  hiwdg.Init.Reload = IWDG_TIMEOUT * (LSI_VALUE / 1000) / 32;   //1秒超时
  if (HAL_IWDG_Init(&hiwdg) != HAL_OK)
  {
    Error_Handler();
  }

}

/**
* 名称       : BSP_IWDG_Refresh()
* 创建日期   : 2020-04-27
* 作者       : 杨春林
* 功能       : 独立看门狗喂狗
* 输入参数   : 无
* 输出参数   : 无
* 返回结果   : 无
* 注意和说明 : 
* 修改内容   :
*/
void BSP_IWDG_Refresh(void)
{
    HAL_IWDG_Refresh(&hiwdg);
}

